app/views/comments/edit.html.erb

SELECT "recipes".* FROM "recipes"
---

    <%= f.collection_check_boxes :recipe_id, Recipe.all, :id, :name %>