app/views/recipes/index.html.erb

   Instructions: <%= recipe.instructions %><br>
   <% recipe.ingredients.each do |i| %>
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = ?  [["recipe_id", 75]]