app/views/recipes/show.html.erb


   Ingredients: <%= @recipe.ingredients.each do |i| %><br>
---
SELECT "ingredients".id FROM "ingredients" WHERE "ingredients"."recipe_id" = ?  [["recipe_id", 2]]

  <br> Comments:
  <% @recipe.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."recipe_id" = ?  [["recipe_id", 6]]