app/views/users/show.html.erb

SELECT "recipes".* FROM "recipes" INNER JOIN "comments" ON "recipes"."id" = "comments"."recipe_id" WHERE "comments"."user_id" = ?  [["user_id", 13]]
---

<% @user.recipes.each do |recipe| %><br>

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 1]]
---

<% @user.comments.each do |comment| %><br>