app/controllers/comments_controller.rb

INSERT INTO "comments" ("name", "username", "body", "user_id", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "cesar"], ["username", "cesar121"], ["body", "i like food"], ["user_id", 13], ["recipe_id", 6], ["created_at", "2020-04-15 22:57:15.990721"], ["updated_at", "2020-04-15 22:57:15.990721"]]
---
  def create

    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id
    @recipe = (params[:id])
    @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", "i hatee ice"], ["updated_at", "2020-04-15 03:29:41.364126"], ["id", 2]]
---
  def update
    @comment = Comment.find(params[:id])
    @comment.update(comment_params)

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def destroy
    Comment.find(params[:id]).destroy