app/controllers/ingredients_controller.rb

INSERT INTO "ingredients" ("ingredient_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["ingredient_name", "milk"], ["created_at", "2020-04-17 02:52:43.838871"], ["updated_at", "2020-04-17 02:52:43.838871"]]
---
  def create
    @ingredient = Ingredient.new(ingredient_params)
    @ingredient.save

SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def show
    @ingredient = Ingredient.find(params[:id])