app/controllers/recipes_controller.rb

  def show
      @recipes = Recipe.where(user_id:(current_user.id))
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 2]]

  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.user_id = current_user.id
    @recipe.save
---
INSERT INTO "recipes" ("name", "username", "description", "instructions", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "hiloe"], ["username", "Pompin"], ["description", ""], ["instructions", ""], ["user_id", 2], ["created_at", "2020-04-16 22:28:45.195952"], ["updated_at", "2020-04-16 22:28:45.195952"]]

  def update
    @recipe = Recipe.find(params[:id])
    @recipe.update(recipe_params)
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "recipes" SET "name" = ?, "username" = ?, "description" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["name", "food"], ["username", "pasata"], ["description", "food"], ["updated_at", "2020-04-15 03:19:36.006144"], ["id", 5]]

  def destroy
    Recipe.find(params[:id]).destroy
---
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 2]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]