app/controllers/users_controller.rb

INSERT INTO "users" ("name", "username", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Cesar Mendoza"], ["username", "TajahWajah"], ["bio", "benn gone a minute"], ["created_at", "2020-04-14 20:50:44.510371"], ["updated_at", "2020-04-14 20:50:44.510371"]]
---
  def create
    @user = User.create(user_params(:name, :bio, :username, :password, :password_confirmation))

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "bio" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Cesarin"], ["bio", "i hate cats"], ["updated_at", "2020-04-15 02:45:09.609845"], ["id", 11]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params(:name, :bio))